#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
    
    ЮТТесты.ДобавитьТестовыйНабор("YAxUnit: Домашнее задание").ВТранзакции()
		.ДобавитьТест("ТестСозданиеДокументовПриходТовара", "Проверка создания документов ""ПриходТовара""", "Позитив, Тест-1")
		.ДобавитьТест("ТестСозданиеДокументовРасходТовара", "Проверка создания документов ""РасходТовара""", "Позитив, Тест-1")
		.ДобавитьТест("ТестПроведениеДокументовПриходТовара", "Проверка проведения документов ""ПриходТовара""", "Позитив, Тест-2")
		.ДобавитьТест("ТестПроведениеДокументовРасходТовара", "Проверка проведения документов ""РасходТовара""", "Позитив, Тест-2")
		.ДобавитьТест("ТестДвиженияДокументовПриходТовара_РН_ТоварныеЗапасы", "Проверка наличия движений документов ""ПриходТовара"" по РН ""ТоварныеЗапасы""", "Позитив, Тест-3")
		.ДобавитьТест("ТестДвиженияДокументовРасходТовара_РН_ТоварныеЗапасы", "Проверка наличия движений документов ""РасходТовара"" по РН ""ТоварныеЗапасы""", "Позитив, Тест-3")
		.ДобавитьТест("ТестДвиженияДокументовПриходТовара_РН_Взаиморасчеты", "Проверка наличия движений документов ""ПриходТовара"" по РН ""Взаиморасчеты""", "Позитив, Тест-3")
		.ДобавитьТест("ТестДвиженияДокументовРасходТовара_РН_Взаиморасчеты", "Проверка наличия движений документов ""РасходТовара"" по РН ""Взаиморасчеты""", "Позитив, Тест-3")
		.ДобавитьТест("ТестСведениеВНоль_РН_ТоварныеЗапасы_Позитив", "Проверка сведения в ноль РН ""ТоварныеЗапасы""", "Позитив, Тест-4") 
		.ДобавитьТест("ТестСведениеВНоль_РН_ТоварныеЗапасы_Негатив", "Проверка не сведения в ноль РН ""ТоварныеЗапасы""", "Негатив, Тест-4")
		.ДобавитьТест("ТестСведениеВНоль_РН_Взаиморасчеты_Позитив", "Проверка сведения в ноль РН ""Взаиморасчеты""", "Позитив, Тест-4")
		.ДобавитьТест("ТестСведениеВНоль_РН_Взаиморасчеты_Негатив", "Проверка не сведения в ноль РН ""Взаиморасчеты""", "Негатив, Тест-4")
		;
	
КонецПроцедуры

Процедура ТестСозданиеДокументовПриходТовара() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции
	ВернутьОбъект = Истина;
	Количество = 5;
	Сумма = 1000;
	Контрагент = СозданиеКонтрагента();
	ТоварНаименование = "Тест_Товар";
	Товар = СозданиеТовара(ТоварНаименование);
	
	// 2. Выполнение функции
	ДокументОбъект1 = СозданиеДокументаПриходТовара(Контрагент, Товар, Количество, Сумма).Записать(ВернутьОбъект);
	ДокументОбъект2 = СозданиеДокументаПриходТовара(Контрагент, Товар, Количество, Сумма).Записать(ВернутьОбъект);
	
	// 3. Проверка результатов
	ЮТест.ОжидаетЧто(ДокументОбъект1)
		.ИмеетТип("ДокументОбъект.ПриходТовара")
		;
    ЮТест.ОжидаетЧто(ДокументОбъект2)
		.ИмеетТип("ДокументОбъект.ПриходТовара")
		;
		
КонецПроцедуры
	
Процедура ТестСозданиеДокументовРасходТовара() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции
	ВернутьОбъект = Истина;
	Количество = 5;
	Сумма = 1000;  
	Контрагент = СозданиеКонтрагента();
	ТоварНаименование = "Тест_Товар";
	Товар = СозданиеТовара(ТоварНаименование);
	
	// 2. Выполнение функции
	ДокументОбъект1 = СозданиеДокументаРасходТовара(Контрагент, Товар, Количество, Сумма).Записать(ВернутьОбъект);
	ДокументОбъект2 = СозданиеДокументаРасходТовара(Контрагент, Товар, Количество, Сумма).Записать(ВернутьОбъект);
	
	// 3. Проверка результатов
	ЮТест.ОжидаетЧто(ДокументОбъект1)
		.ИмеетТип("ДокументОбъект.РасходТовара")
		;
    ЮТест.ОжидаетЧто(ДокументОбъект2)
		.ИмеетТип("ДокументОбъект.РасходТовара")
		;
		
КонецПроцедуры
	
Процедура ТестПроведениеДокументовПриходТовара() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции
	ВернутьОбъект = Истина;
	Количество = 5;
	Сумма = 1000;
	Контрагент = СозданиеКонтрагента();
	ТоварНаименование = "Тест_Товар";
	Товар = СозданиеТовара(ТоварНаименование);
	
	// 2. Выполнение функции
	ДокументОбъект1 = СозданиеДокументаПриходТовара(Контрагент, Товар, Количество, Сумма).Записать(ВернутьОбъект);
	ДокументОбъект2 = СозданиеДокументаПриходТовара(Контрагент, Товар, Количество, Сумма).Записать(ВернутьОбъект);
	
	// 3. Проверка результатов
	ЮТест.ОжидаетЧто(ДокументОбъект1)
		.Метод("Записать").Параметр(РежимЗаписиДокумента.Проведение).Параметр(РежимПроведенияДокумента.Оперативный)
		.НеВыбрасываетИсключение()
		;
	ЮТест.ОжидаетЧто(ДокументОбъект2)
		.Метод("Записать").Параметр(РежимЗаписиДокумента.Проведение).Параметр(РежимПроведенияДокумента.Оперативный)
		.НеВыбрасываетИсключение()
		;
		
КонецПроцедуры
	
Процедура ТестПроведениеДокументовРасходТовара() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции
	ВернутьОбъект = Истина;
	Количество = 5;
	Сумма = 1000; 
	Контрагент = СозданиеКонтрагента();
	ТоварНаименование = "Тест_Товар";
	Товар = СозданиеТовара(ТоварНаименование);
	
	// 2. Выполнение функции
	ДокументОбъект1 = СозданиеДокументаРасходТовара(Контрагент, Товар, Количество, Сумма).Записать(ВернутьОбъект);
	ДокументОбъект2 = СозданиеДокументаРасходТовара(Контрагент, Товар, Количество, Сумма).Записать(ВернутьОбъект);
	
	// 3. Проверка результатов
	ЮТест.ОжидаетЧто(ДокументОбъект1)
		.Метод("Записать").Параметр(РежимЗаписиДокумента.Проведение).Параметр(РежимПроведенияДокумента.Оперативный)
		.НеВыбрасываетИсключение()
		;
	ЮТест.ОжидаетЧто(ДокументОбъект2)
		.Метод("Записать").Параметр(РежимЗаписиДокумента.Проведение).Параметр(РежимПроведенияДокумента.Оперативный)
		.НеВыбрасываетИсключение()
		;

КонецПроцедуры

Процедура ТестДвиженияДокументовПриходТовара_РН_ТоварныеЗапасы() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции
	ВернутьОбъект = Ложь;
	Количество = 5;
	Сумма = 1000;
	Контрагент = СозданиеКонтрагента();
	Склад = Справочники.Склады.НайтиПоКоду("000000001");
	ТоварНаименование = "Тест_Товар";
	Товар = СозданиеТовара(ТоварНаименование);
	
	// 2. Выполнение функции
	ДокументОбъект1 = СозданиеДокументаПриходТовара(Контрагент, Товар, Количество, Сумма).Провести();
	ДокументОбъект2 = СозданиеДокументаПриходТовара(Контрагент, Товар, Количество, Сумма).Провести();
	
	Запись1 = ЮТЗапросы.Запись("РегистрНакопления.ТоварныеЗапасы",
		ЮТест.Предикат()
			.Реквизит("Регистратор").Равно(ДокументОбъект1))
			; 
	Запись2 = ЮТЗапросы.Запись("РегистрНакопления.ТоварныеЗапасы",
		ЮТест.Предикат()
			.Реквизит("Регистратор").Равно(ДокументОбъект2))
			;
			
	// 3. Проверка результатов
	ЮТест.ОжидаетЧто(Запись1)
		.Свойство("Регистратор").Равно(ДокументОбъект1)
		.Свойство("ВидДвижения").Равно(ВидДвиженияНакопления.Приход)
		.Свойство("Склад").Равно(Склад)
		.Свойство("Товар").Равно(Товар)
		.Свойство("Количество").Равно(Количество)
		;
		
	ЮТест.ОжидаетЧто(Запись2)
		.Свойство("Регистратор").Равно(ДокументОбъект2)
		.Свойство("ВидДвижения").Равно(ВидДвиженияНакопления.Приход)
		.Свойство("Склад").Равно(Склад)
		.Свойство("Товар").Равно(Товар)
		.Свойство("Количество").Равно(Количество)
		;

КонецПроцедуры

Процедура ТестДвиженияДокументовРасходТовара_РН_ТоварныеЗапасы() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции
	ВернутьОбъект = Истина;
	Количество = 5;
	Сумма = 1000; 
	Контрагент = СозданиеКонтрагента();
	Склад = Справочники.Склады.НайтиПоКоду("000000001"); 
	ТоварНаименование = "Тест_Товар";
	Товар = СозданиеТовара(ТоварНаименование);
	
	// 2. Выполнение функции
	ДокументОбъект1 = СозданиеДокументаРасходТовара(Контрагент, Товар, Количество, Сумма).Провести();
	ДокументОбъект2 = СозданиеДокументаРасходТовара(Контрагент, Товар, Количество, Сумма).Провести();
	
	Запись1 = ЮТЗапросы.Запись("РегистрНакопления.ТоварныеЗапасы",
		ЮТест.Предикат()
			.Реквизит("Регистратор").Равно(ДокументОбъект1))
			; 
	Запись2 = ЮТЗапросы.Запись("РегистрНакопления.ТоварныеЗапасы",
		ЮТест.Предикат()
			.Реквизит("Регистратор").Равно(ДокументОбъект2))
			;
			
	// 3. Проверка результатов
	ЮТест.ОжидаетЧто(Запись1)
		.Свойство("Регистратор").Равно(ДокументОбъект1)
		.Свойство("ВидДвижения").Равно(ВидДвиженияНакопления.Расход)
		.Свойство("Склад").Равно(Склад)
		.Свойство("Товар").Равно(Товар)
		.Свойство("Количество").Равно(Количество)
		;
		
	ЮТест.ОжидаетЧто(Запись2)
		.Свойство("Регистратор").Равно(ДокументОбъект2)
		.Свойство("ВидДвижения").Равно(ВидДвиженияНакопления.Расход)
		.Свойство("Склад").Равно(Склад)
		.Свойство("Товар").Равно(Товар)
		.Свойство("Количество").Равно(Количество)
		;

КонецПроцедуры

Процедура ТестДвиженияДокументовПриходТовара_РН_Взаиморасчеты() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции
	ВернутьОбъект = Истина;
	Количество = 5;
	Сумма = 1000;
	Контрагент = СозданиеКонтрагента();
	Валюта = Справочники.Валюты.НайтиПоКоду("000000001"); 
	ТоварНаименование = "Тест_Товар";
	Товар = СозданиеТовара(ТоварНаименование);
	
	// 2. Выполнение функции
	ДокументОбъект1 = СозданиеДокументаПриходТовара(Контрагент, Товар, Количество, Сумма).Провести();
	ДокументОбъект2 = СозданиеДокументаПриходТовара(Контрагент, Товар, Количество, Сумма).Провести();
	
	Запись1 = ЮТЗапросы.Запись("РегистрНакопления.Взаиморасчеты",
		ЮТест.Предикат()
			.Реквизит("Регистратор").Равно(ДокументОбъект1))
			; 
	Запись2 = ЮТЗапросы.Запись("РегистрНакопления.Взаиморасчеты",
		ЮТест.Предикат()
			.Реквизит("Регистратор").Равно(ДокументОбъект2))
			;
			
	// 3. Проверка результатов
	ЮТест.ОжидаетЧто(Запись1)
		.Свойство("Регистратор").Равно(ДокументОбъект1)
		.Свойство("ВидДвижения").Равно(ВидДвиженияНакопления.Приход)
		.Свойство("Контрагент").Равно(Контрагент)
		.Свойство("Валюта").Равно(Валюта)
		.Свойство("Сумма").Равно(Сумма)
		;
		
	ЮТест.ОжидаетЧто(Запись2)
		.Свойство("Регистратор").Равно(ДокументОбъект2)
		.Свойство("ВидДвижения").Равно(ВидДвиженияНакопления.Приход)
		.Свойство("Контрагент").Равно(Контрагент)
		.Свойство("Валюта").Равно(Валюта)
		.Свойство("Сумма").Равно(Сумма)
		;

КонецПроцедуры

Процедура ТестДвиженияДокументовРасходТовара_РН_Взаиморасчеты() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции
	ВернутьОбъект = Истина;
	Количество = 5;
	Сумма = 1000;
	Контрагент = СозданиеКонтрагента();
	Валюта = Справочники.Валюты.НайтиПоКоду("000000001");
	ТоварНаименование = "Тест_Товар";
	Товар = СозданиеТовара(ТоварНаименование);
	
	// 2. Выполнение функции
	ДокументОбъект1 = СозданиеДокументаРасходТовара(Контрагент, Товар, Количество, Сумма).Провести();
	ДокументОбъект2 = СозданиеДокументаРасходТовара(Контрагент, Товар, Количество, Сумма).Провести();
	
	Запись1 = ЮТЗапросы.Запись("РегистрНакопления.Взаиморасчеты",
		ЮТест.Предикат()
			.Реквизит("Регистратор").Равно(ДокументОбъект1))
			; 
	Запись2 = ЮТЗапросы.Запись("РегистрНакопления.Взаиморасчеты",
		ЮТест.Предикат()
			.Реквизит("Регистратор").Равно(ДокументОбъект2))
			;
			
	// 3. Проверка результатов
	ЮТест.ОжидаетЧто(Запись1)
		.Свойство("Регистратор").Равно(ДокументОбъект1)
		.Свойство("ВидДвижения").Равно(ВидДвиженияНакопления.Расход)
		.Свойство("Контрагент").Равно(Контрагент)
		.Свойство("Валюта").Равно(Валюта)
		.Свойство("Сумма").Равно(Сумма)
		;
		
	ЮТест.ОжидаетЧто(Запись2)
		.Свойство("Регистратор").Равно(ДокументОбъект2)
		.Свойство("ВидДвижения").Равно(ВидДвиженияНакопления.Расход)
		.Свойство("Контрагент").Равно(Контрагент)
		.Свойство("Валюта").Равно(Валюта)
		.Свойство("Сумма").Равно(Сумма)
		;

КонецПроцедуры

Процедура ТестСведениеВНоль_РН_ТоварныеЗапасы_Позитив() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции
	ВернутьОбъект = Истина;
	Количество = 5;
	Сумма = 1000;
	Контрагент = СозданиеКонтрагента();
	Склад = Справочники.Склады.НайтиПоКоду("000000001"); 
	ТоварНаименование = "Тест_Товар";
	Товар = СозданиеТовара(ТоварНаименование);
	
	// 2. Выполнение функции
	ДокументОбъект1 = СозданиеДокументаПриходТовара(Контрагент, Товар, Количество, Сумма).Провести();
	ДокументОбъект2 = СозданиеДокументаПриходТовара(Контрагент, Товар, Количество, Сумма).Провести();
	ДокументОбъект3 = СозданиеДокументаРасходТовара(Контрагент, Товар, Количество, Сумма).Провести();
	ДокументОбъект4 = СозданиеДокументаРасходТовара(Контрагент, Товар, Количество, Сумма).Провести();
	
	ОписаниеЗапроса = ЮТЗапросы.ОписаниеЗапроса();
	ОписаниеЗапроса.ИмяТаблицы = "РегистрНакопления.ТоварныеЗапасы.Остатки";
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("Склад");
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("Товар");
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("КоличествоОстаток");
	ОписаниеЗапроса.Условия.Добавить("Склад = &Склад");
	ОписаниеЗапроса.Условия.Добавить("Товар = &Товар");
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Склад", Склад);
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Товар", Товар);
	Результат = ЮТЗапросы.РезультатЗапроса(ОписаниеЗапроса); 
	
	// 3. Проверка результатов
	ЮТест.ОжидаетЧто(Результат)
		.НеЗаполнено()
		;

КонецПроцедуры
	
Процедура ТестСведениеВНоль_РН_ТоварныеЗапасы_Негатив() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции
	ВернутьОбъект = Истина;
	Количество = 5;
	КоличествоДругое = 10;
	Сумма = 1000;
	Контрагент = СозданиеКонтрагента();
	Склад = Справочники.Склады.НайтиПоКоду("000000001");
	ТоварНаименование = "Тест_Товар";
	Товар = СозданиеТовара(ТоварНаименование);
	
	// 2. Выполнение функции
	ДокументОбъект1 = СозданиеДокументаПриходТовара(Контрагент, Товар, Количество, Сумма).Провести();
	ДокументОбъект2 = СозданиеДокументаПриходТовара(Контрагент, Товар, Количество, Сумма).Провести();
	ДокументОбъект3 = СозданиеДокументаРасходТовара(Контрагент, Товар, Количество, Сумма).Провести();
	ДокументОбъект4 = СозданиеДокументаРасходТовара(Контрагент, Товар, КоличествоДругое, Сумма).Провести();
	
	ОписаниеЗапроса = ЮТЗапросы.ОписаниеЗапроса();
	ОписаниеЗапроса.ИмяТаблицы = "РегистрНакопления.ТоварныеЗапасы.Остатки";
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("Склад");
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("Товар");
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("КоличествоОстаток");
	ОписаниеЗапроса.Условия.Добавить("Склад = &Склад");
	ОписаниеЗапроса.Условия.Добавить("Товар = &Товар");
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Склад", Склад);
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Товар", Товар);
	Результат = ЮТЗапросы.РезультатЗапроса(ОписаниеЗапроса); 

	// 3. Проверка результатов
	ЮТест.ОжидаетЧто(Результат)
		.ИмеетТип("ТаблицаЗначений")
		.Свойство("[0].КоличествоОстаток").НеРавно(0)
		;

КонецПроцедуры

Процедура ТестСведениеВНоль_РН_Взаиморасчеты_Позитив() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции
	ВернутьОбъект = Истина;
	Количество = 5;
	Сумма = 1000;
	Контрагент = СозданиеКонтрагента();
	Валюта = Справочники.Валюты.НайтиПоКоду("000000001"); 
	ТоварНаименование = "Тест_Товар";
	Товар = СозданиеТовара(ТоварНаименование);
	
	// 2. Выполнение функции
	ДокументОбъект1 = СозданиеДокументаПриходТовара(Контрагент, Товар, Количество, Сумма).Провести();
	ДокументОбъект2 = СозданиеДокументаПриходТовара(Контрагент, Товар, Количество, Сумма).Провести();
	ДокументОбъект3 = СозданиеДокументаРасходТовара(Контрагент, Товар, Количество, Сумма).Провести();
	ДокументОбъект4 = СозданиеДокументаРасходТовара(Контрагент, Товар, Количество, Сумма).Провести();
	
	ОписаниеЗапроса = ЮТЗапросы.ОписаниеЗапроса();
	ОписаниеЗапроса.ИмяТаблицы = "РегистрНакопления.Взаиморасчеты.Остатки";
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("Контрагент");
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("Валюта");
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("СуммаОстаток");
	ОписаниеЗапроса.Условия.Добавить("Контрагент = &Контрагент");
	ОписаниеЗапроса.Условия.Добавить("Валюта = &Валюта");
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Контрагент", Контрагент);
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Валюта", Валюта);
	Результат = ЮТЗапросы.РезультатЗапроса(ОписаниеЗапроса); 
	
	// 3. Проверка результатов
	ЮТест.ОжидаетЧто(Результат)
		.НеЗаполнено()
		;

КонецПроцедуры
	
Процедура ТестСведениеВНоль_РН_Взаиморасчеты_Негатив() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции
	ВернутьОбъект = Истина;
	Количество = 5;
	Сумма = 1000;
	СуммаДругая = 2000;
	Контрагент = СозданиеКонтрагента();
	Валюта = Справочники.Валюты.НайтиПоКоду("000000001"); 
	ТоварНаименование = "Тест_Товар";
	Товар = СозданиеТовара(ТоварНаименование);
	
	// 2. Выполнение функции
	ДокументОбъект1 = СозданиеДокументаПриходТовара(Контрагент, Товар, Количество, Сумма).Провести();
	ДокументОбъект2 = СозданиеДокументаПриходТовара(Контрагент, Товар, Количество, Сумма).Провести();
	ДокументОбъект3 = СозданиеДокументаРасходТовара(Контрагент, Товар, Количество, Сумма).Провести();
	ДокументОбъект4 = СозданиеДокументаРасходТовара(Контрагент, Товар, Количество, СуммаДругая).Провести();
	
	ОписаниеЗапроса = ЮТЗапросы.ОписаниеЗапроса();
	ОписаниеЗапроса.ИмяТаблицы = "РегистрНакопления.Взаиморасчеты.Остатки";
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("Контрагент");
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("Валюта");
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("СуммаОстаток");
	ОписаниеЗапроса.Условия.Добавить("Контрагент = &Контрагент");
	ОписаниеЗапроса.Условия.Добавить("Валюта = &Валюта");
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Контрагент", Контрагент);
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Валюта", Валюта);
	Результат = ЮТЗапросы.РезультатЗапроса(ОписаниеЗапроса); 
	
	// 3. Проверка результатов
	ЮТест.ОжидаетЧто(Результат)
		.ИмеетТип("ТаблицаЗначений")
		.Свойство("[0].СуммаОстаток").НеРавно(0)
		;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СозданиеТовара(ТоварНаименование) Экспорт

	Товар = ЮТест.Данные().КонструкторОбъекта("Справочники.Товары")
		.ФикцияОбязательныхПолей()
		.Установить("Наименование", ТоварНаименование)
		.Записать()
		;
		
	Возврат Товар;

КонецФункции // ()

Функция СозданиеКонтрагента() Экспорт

	Контрагент = ЮТест.Данные().КонструкторОбъекта("Справочники.Контрагенты")
		.ФикцияОбязательныхПолей()
		.Установить("Наименование", "Тест_Контрагент")
		.Записать()
		;
		
	Возврат Контрагент;

КонецФункции

Функция СозданиеДокументаПриходТовара(Контрагент, Товар, Количество, Сумма) Экспорт
	
	Склад = Справочники.Склады.НайтиПоКоду("000000001");
	Валюта = Справочники.Валюты.НайтиПоКоду("000000001");
	
	Ссылка = ЮТест.Данные().КонструкторОбъекта("Документ.ПриходТовара")
		.ФикцияОбязательныхПолей()
		.Установить("Дата", ТекущаяДата())
		.Установить("Поставщик", Контрагент)
		.Установить("Склад", Склад)
		.Установить("Валюта", Валюта)
		.ТабличнаяЧасть("Товары")
			.ДобавитьСтроку()
				.ФикцияОбязательныхПолей()
				.Установить("Товар", Товар)
				.Установить("Количество", Количество)
				.Установить("Сумма", Сумма)
		;
		
	Возврат Ссылка;
		
КонецФункции 
	
Функция СозданиеДокументаРасходТовара(Контрагент, Товар, Количество, Сумма) Экспорт
	
	Склад = Справочники.Склады.НайтиПоКоду("000000001");
	Валюта = Справочники.Валюты.НайтиПоКоду("000000001");
	
	Ссылка = ЮТест.Данные().КонструкторОбъекта("Документ.РасходТовара")
		.ФикцияОбязательныхПолей()
		.Установить("Дата", ТекущаяДата())
		.Установить("Покупатель", Контрагент)
		.Установить("Склад", Склад)
		.Установить("Валюта", Валюта)
		.ТабличнаяЧасть("Товары")
			.ДобавитьСтроку()
				.ФикцияОбязательныхПолей()
				.Установить("Товар", Товар)
				.Установить("Количество", Количество)
				.Установить("Сумма", Сумма)
		;
		
	Возврат Ссылка;
		
КонецФункции

#КонецОбласти